- CHAR takes up 1 byte per character. 
- a CHAR(100) field (or variable) takes up 100 bytes, regardless of the string it holds.

- VARCHAR is a variable length string data type
- it holds only the characters you assign to it
- VARCHAR takes up 1 byte per character
(+ 2 bytes to hold length information)
- Text n bytes + 4 bytes

When should I use CHAR instead of VARCHAR?
The short answer is: Almost never.
If your business rules say that the State column will ALWAYS be two characters long, then use CHAR(2).
A single letter string. For example, we should use CHAR(1) for a middle initial column.
Fixed length product codes

- add postgres user to LINUX_USER group:
> sudo adduser postgres LINUX-USER

- check in what groups is the user postgres:
> groups postgres

- remove postgres user from dci-student
> sudo deluser postgres dci-student

# Connect Jupyter Notebook with postgresql
> python3 -m pip install ipython-sql

> python3 -m pip install sqlalchemy 

> python3 -m pip install psycopg2

- then login to your postgresql's shell environment:
> psql

- create a database:
> create database db_live;

- give the postgres user access to that database:
> \c db_live

> ALTER USER "postgres" WITH PASSWORD 'password';

In [155]:
import psycopg2

psycopg2.connect(
    host="localhost",
    database="db_live",
    user="postgres",
    password="password"
)

In [156]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [157]:
from sqlalchemy import create_engine

In [158]:
%sql postgresql://postgres:password@localhost/db_live
%sql CREATE TABLE test (name varchar(100))

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "test" already exists

[SQL: CREATE TABLE test (name varchar(100))]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [159]:
%sql insert into test values ('BOB')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [160]:
%sql select * from test

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[('Bob Doe',), ('BOB',)]

## Keys

- Keys are columns in a table.
- their values can be used to uniquely identify a row in a table.
- Keys are always unique
- almost all tables should have a key

In [161]:
%sql CREATE TABLE people (full_name varchar(150) PRIMARY KEY,description text)

 * postgresql://postgres:***@localhost/db_live
Done.

[]

- the table people can't store persons with the same full name
- a primary key which has meaning is also called natural primary key
- when a table does not have unique fields, a surrogate primary key is used
- surrogate primary key are often called id

In [162]:
%%sql 
CREATE TABLE city( 
 name varchar(30), 
 region varchar(30), 
 country varchar(30),
 PRIMARY KEY(name, region, country))

 * postgresql://postgres:***@localhost/db_live
Done.

[]

- Primary keys can be declared on multiple columns at once.
- no two rows can have the same combination of name, region and country

### Foreign Keys

- foreign key is a column
- a foreign key points to a unique column of another table
- don't have to be unique
- they usually refer to the primary key
- these keys form relationships between tables

In [163]:
%%sql
CREATE TABLE friends ( id serial PRIMARY KEY, name varchar(100) );

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.DuplicateTable) relation "friends" already exists

[SQL: CREATE TABLE friends ( id serial PRIMARY KEY, name varchar(100) );]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [164]:
%%sql
CREATE TABLE message ( id serial PRIMARY KEY,
                        friend_id int REFERENCES friends(id),
                        text text)

 * postgresql://postgres:***@localhost/db_live
Done.

[]

### Populating Foreign Keys

In [165]:
%%sql
INSERT INTO message(friend_id, text)
VALUES(10, 'How are you doing?')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [166]:
%%sql
INSERT INTO friends( name)
VALUES('Lisa')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [167]:
%%sql
SELECT * FROM friends;

 * postgresql://postgres:***@localhost/db_live
11 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (11, 'Lisa', datetime.datetime(2023, 3, 6, 19, 11, 41), datetime.datetime(2023, 3, 6, 19, 11, 41))]

In [168]:
%%sql
INSERT INTO message(friend_id, text)
VALUES(1, 'How are you doing?')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [169]:
%%sql
SELECT * FROM message;

 * postgresql://postgres:***@localhost/db_live
2 rows affected.

[(1, 10, 'How are you doing?'), (2, 1, 'How are you doing?')]

In [170]:
%%sql
INSERT INTO message(friend_id, text)
VALUES(2, 'How are you doing?')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [171]:
%%sql
SELECT friends.name, message.text
FROM friends, message
WHERE friends.id = message.friend_id

 * postgresql://postgres:***@localhost/db_live
3 rows affected.

[('Martha Smith', 'How are you doing?'),
 ('Cathy Williams', 'How are you doing?'),
 ('Brian Ortiz', 'How are you doing?')]

## Deleting Related Rows

In [172]:
%%sql
DELETE FROM friends WHERE id = 1

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.ForeignKeyViolation) update or delete on table "friends" violates foreign key constraint "message_friend_id_fkey" on table "message"
DETAIL:  Key (id)=(1) is still referenced from table "message".

[SQL: DELETE FROM friends WHERE id = 1]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [173]:
%%sql
drop table message

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [174]:
%%sql
CREATE TABLE message ( id serial PRIMARY KEY,
                        friend_id int REFERENCES friends(id)
                        ON DELETE SET NULL,
                        text text)

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [175]:
%%sql
INSERT INTO message(friend_id, text)
VALUES(1, 'How are you doing?')

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [176]:
%%sql
DELETE FROM friends WHERE id = 1

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[]

In [177]:
%%sql
SELECT * FROM message

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(1, None, 'How are you doing?')]

- instead of ON DELETE SET NULL we could also write:
ON DELETE SET CASCADE
- CASCADE will delete the referencing row.

#### For postgres meta commands install:
> python3 -m pip install pgspecial

## Views
- views are a named queries
- view are known as base tables
- you basically create a query and assign a name to the query.
- Only SELECT statements are used in Views.
- when a view is executed, the underlying statement is executed.

Remember how we combined two tables:

In [178]:
%%sql
--why do we have 100 rows?
select count(*)  from friends, messages

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(100,)]

In [179]:
%%sql 
create view MY_COUNT as 
select count(*) from friends, messages

 * postgresql://postgres:***@localhost/db_live
Done.

[]

- MY_COUNT is now a table I can use:

In [180]:
%%sql 
select * from MY_COUNT

 * postgresql://postgres:***@localhost/db_live
1 rows affected.

[(100,)]

lets store two table in one table as a view

In [181]:
%%sql
drop view MY_FRIENDS;
create view MY_FRIENDS as
select friends.id as f_id, friends.name as full_name, messages.friends_id, messages.message 
from friends, messages

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) view "my_friends" does not exist

[SQL: drop view MY_FRIENDS;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [182]:
%%sql
select * from MY_FRIENDS
where f_id = friends_id

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) relation "my_friends" does not exist
LINE 1: select * from MY_FRIENDS
                      ^

[SQL: select * from MY_FRIENDS
where f_id = friends_id]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [183]:
%%sql
drop view if exists MY_FRIENDS;
create view MY_FRIENDS as
select friends.id, friends.name as full_name, messages.message 
from friends, messages
where friends.id = messages.friends_id

 * postgresql://postgres:***@localhost/db_live
Done.
Done.

[]

In [184]:
%%sql
select * from MY_FRIENDS
where full_name not like 'C%' 
order by id;

 * postgresql://postgres:***@localhost/db_live
9 rows affected.

[(3, 'Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 (3, 'Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 (3, 'Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 (5, 'Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 (5, 'Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 (5, 'Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 (7, 'Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.'),
 (7, 'Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 (10, 'Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.')]

### Rename View

In [185]:
%%sql 
alter view if exists MY_FRIENDS
rename to full_name_messages

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [186]:
%%sql
select * from full_name_messages
where full_name not like 'C%' 
order by id;

 * postgresql://postgres:***@localhost/db_live
9 rows affected.

[(3, 'Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 (3, 'Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 (3, 'Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 (5, 'Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 (5, 'Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 (5, 'Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 (7, 'Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.'),
 (7, 'Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 (10, 'Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.')]

## Replace view

In [187]:
%%sql
create or replace view full_name_message as
select * from full_name_messages
where full_name not like 'C%' 
order by id;
select * from full_name_message;

 * postgresql://postgres:***@localhost/db_live
Done.
9 rows affected.

[(3, 'Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 (3, 'Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 (3, 'Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 (5, 'Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 (5, 'Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 (5, 'Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 (7, 'Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.'),
 (7, 'Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 (10, 'Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.')]

### Updatable Views
- INSERT, UPDATE and DELETE can be used on a view, only if the view is defined with one single table and the columns modified are present in the view:

In [188]:
%%sql
insert into full_name_message(full_name, message) values ('Bob', 'hello')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.ObjectNotInPrerequisiteState) cannot insert into view "full_name_messages"
DETAIL:  Views that do not select from a single table or view are not automatically updatable.
HINT:  To enable inserting into the view, provide an INSTEAD OF INSERT trigger or an unconditional ON INSERT DO INSTEAD rule.

[SQL: insert into full_name_message(full_name, message) values ('Bob', 'hello')]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [189]:
%%sql
drop view my_friends;
create view my_friends as
select * from friends
where name not like '%y%';
select * from my_friends;
select * from friends;

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) view "my_friends" does not exist

[SQL: drop view my_friends;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [190]:
%%sql
insert into my_friends(name) values ('Bob')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) relation "my_friends" does not exist
LINE 1: insert into my_friends(name) values ('Bob')
                    ^

[SQL: insert into my_friends(name) values ('Bob')]
(Background on this error at: https://sqlalche.me/e/20/f405)

- inserting in views also affects the underlying table of the view

In [191]:
%%sql 
select * from friends

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[(2, 'Brian Ortiz', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (3, 'Marc Hansen', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 6, 19, 11, 23), datetime.datetime(2023, 3, 6, 19, 11, 23)),
 (11, 'Lisa', datetime.datetime(2023, 3, 6, 19, 11, 41), datetime.datetime(2023, 3, 6, 19, 11, 41))]

The values inserted do not need to match the conditions in the view.

In [192]:
%%sql
insert into my_friends(name) values ('Byb')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) relation "my_friends" does not exist
LINE 1: insert into my_friends(name) values ('Byb')
                    ^

[SQL: insert into my_friends(name) values ('Byb')]
(Background on this error at: https://sqlalche.me/e/20/f405)

Adding WITH CHECK OPTION will require the inserted values to match the conditions in the query defined in the view.

In [193]:
%%sql
drop view my_friends;
create view my_friends as
select * from friends
where name not like '%y%'
with check option;
select * from my_friends;
select * from friends;

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) view "my_friends" does not exist

[SQL: drop view my_friends;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [194]:
%%sql
insert into my_friends(name) values ('Byb')

 * postgresql://postgres:***@localhost/db_live
(psycopg2.errors.UndefinedTable) relation "my_friends" does not exist
LINE 1: insert into my_friends(name) values ('Byb')
                    ^

[SQL: insert into my_friends(name) values ('Byb')]
(Background on this error at: https://sqlalche.me/e/20/f405)

## Materialized Views

- A materialized view is a view that has been made persistent
- Subsequent calls to the view, will not process the underlying query
- you can refresh the materialized view

In [195]:
%%sql 
 \d messages

 * postgresql://postgres:***@localhost/db_live
5 rows affected.

[['id', 'integer', " not null default nextval('messages_id_seq'::regclass)"],
 ['friends_id', 'integer', ''],
 ['message', 'text', ' not null'],
 ['created_at', 'timestamp(0) without time zone', ' default now()'],
 ['updated_at', 'timestamp(0) without time zone', ' default now()']]

In [202]:
%%sql 
CREATE MATERIALIZED VIEW friend_messages AS
SELECT friends.name, messages.message
FROM friends, messages
WHERE friends.id = messages.friends_id;

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[]

In [203]:
%%sql
select * from friend_messages

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[('Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 ('Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 ('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]

In [204]:
%%sql
delete from friends
where name like '%Marc%';
select * from friends

 * postgresql://postgres:***@localhost/db_live
1 rows affected.
9 rows affected.

[(1, 'Cathy Williams', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (2, 'Brian Ortiz', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (4, 'Lisa Meyer', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (5, 'Yolanda Hanson', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (6, 'Kenneth Lawrence', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (7, 'Deanna Barber', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (8, 'Dr. Jeffrey Harper', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (9, 'Stacey Hall', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31)),
 (10, 'Martha Smith', datetime.datetime(2023, 3, 6, 19, 15, 31), datetime.datetime(2023, 3, 6, 19, 15, 31))]

In [205]:
%%sql
select * from friend_messages

 * postgresql://postgres:***@localhost/db_live
10 rows affected.

[('Marc Hansen', 'Yet add financial pull consumer Mrs American.\nAll television loss data decide. Thing go ask car go international. To key finally chair seek window street act.'),
 ('Marc Hansen', 'Hit plan everybody but feel example especially. Play laugh tell.\nPoint impact figure figure culture officer skill side. That service growth ask leave. Center area power treatment example risk me.'),
 ('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Marc Hansen', 'Laugh positive always study president institution sort. Strategy seem sit art deep fast threat.\nDebate respond defense about million. Chair note truth idea across interesting write special.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]

## Refresh

In [206]:
%%sql

refresh MATERIALIZED view friend_messages;

 * postgresql://postgres:***@localhost/db_live
Done.

[]

In [207]:
%%sql
select * from friend_messages

 * postgresql://postgres:***@localhost/db_live
7 rows affected.

[('Yolanda Hanson', 'Whom race energy a. Beautiful firm address commercial.\nScientist capital decade face cultural individual. President my large market trade direction pick.'),
 ('Yolanda Hanson', 'Professional yes say worker. These it least expert world whether personal.'),
 ('Martha Smith', 'Week owner head laugh else. Course about admit order education shake. South behind military type.'),
 ('Deanna Barber', 'Institution ball concern fill season believe. Live it enjoy argue act.'),
 ('Yolanda Hanson', 'Let sea by green. Over pay movement per arrive start bed. Name yet behavior mind capital look.\nBoard example common boy whether theory professor.'),
 ('Cathy Williams', 'Can her score rather. Go pick church mission. Operation PM home camera board.\nConsider local deal message piece mind TV. Medical subject training six.'),
 ('Deanna Barber', 'Painting friend lay approach politics kind. Series not finally sort.')]